const challenge = require('.');

it('Zalgo text reader', () => {
  expect(challenge("H̗̪͇͓̙͎̣̄ͬa͚̯̦͉̖̥v͆ͩ̃͆̓̐ͥe̟͎͖͕͍̎ ̰͚̩̟͕̰͊̽̍ͯ̌͊ā̖̪͉͍̥͙̿ͩ̃ͅ ̬̥͎͑̿ͧg̰̳̺͔̦͉ͫ̀̐̓̐r̝̫̱̘̰͐͋ͯͭͭͭ͆e͙͕̖̗͙̰͌ͭä͓͚̝͓́̌͑ͪ͊ṱͥ ̱ͣd͎͔͎͇̫̪̘̃͐̇à͕̮̈͋ͪy̼̳̱ͮ!̳̥̰̭͇̔ͮ̽̓")).toBe("Have a great day!");
  expect(challenge("R̳͓̅́i̳͔̘̤̊̒ẗ̠̜̯̳͍́ͪȗ̟ͨ̾a͔̜̘̮̼̯͖ͯ̄̃̾ͩl̺ͥ̒͑ͨ ̞̣͙̻̱̒͂̇ͪh͙͓͕̻̼̳́̇ͨ̄ͣú̬̻̮͙͖̮̫̓ͦ̚m̪͎̦͍̬̲͍ͬ̋́a̲͈̳̲̝̖̮ͫͨ̒͑̑n̖͓̬̠̮͓͂̚ͅ ͇͓͕̝̹̜̽̏̿̍s͉̯͔̻̰̰̩a̅̿cr͕̮̹͔̒̏͋̒ͬͬi̩͋ͧ̇̇̒ͥ̓f͔̝͙̓͂͒̾͐ͤī̠̯͍̼̤͕̾ͭ͂ͩ̆̓c̙͙̰ͬ̓eͣ͑̾ͪ ͖͕͙ͫ̍̔ͬ̆̀ͮi͎̖̼̘͍͉ͩͦ͆̑̍ͅș͍̜ͧ̇͋̃̍͂͛ ̞ͪ̉̓̉̀ͫ̓âͮͩ̆ ̳̓͒̎͑͑̓̇g̥̳͖͎̃̌͗ͬͬ͋r͈ͯö́͑̑ͣẉ̥ṯ̝͙̩͔͚̄͛h͕̩̯͎̰̯̮ ͩi͖͙̮͔̙̱̿ͅn̏̇͊ͤ̿ͩd̖͉̥̻͙̈́͆͗ͤ́ͪu͈͈͛ͥͅs̐̋̎̋tͫͨry̖̲͉͙͔̑ͧͤͣ̿͋̏.͉̩̣̪͛ͬ́̊̑")).toBe("Ritual human sacrifice is a growth industry.");
  expect(challenge("Z̒̈́̚a͖͛lͫ̐̍ͥͣ͌̌g̭̏͗ͧͭͯͩ̚ȍ̱̤̤̂̂ ͔̂͋́w̰̻̪̆ͧ̔i̠̤̤͓̹͕͛͂ͤ̄͐l͍͇̮̰͇̱ͮ͊͛̍̚ͅl͈͙̼̗̗͑̄ͥ̌ ̘͇̟̩̂̈̌ͣͮ͆ͩͅc͈̼̺̽ͨ̋̈̉ͫ̐ͅo͒̈ṃ̗̫̹̌ͧ̎e̓͋ͨ̾̚ ̝̬̞͇̼́͌͂̌ͯͧͅi͍͙̺̼̣̖͌̌̓̐ͩͥ͊n̦̒ ͔̰̩̠̬͖ͩt͚̩͔͐ĥ͇͔̞͇͕̤̫̊̽͂͋̿e̪̪͓̠̪̙̊̑̋͗ͩ̿̍ ̙͇́y͈̻͚̹̗e̺͐́̽aͮ̏r̜͕͓̮ ͋2̻̠̰̦̠͚͕0̠̼̻̈̍̾̚41.")).toBe("Zalgo will come in the year 2041.");
});
